import random

comEdu = ["#엔트리", "#레고", "#로블록스", "#마인크래프트", "#스크래치", 
          "#파이썬", "#마이크로비트", "#python", "#entry", "#scratch", 
          "#타자연습", "#온라인코딩파티", "#코딩이란", "#unity","#프로그래밍", 
          "#인공지능", "#코딩", "#코딩공부혼자하기", "#로봇", "#로봇코딩", 
          "#특성화고", "#코딩파티", "#아두이노", "#블록코딩", "#유니티", 
          "#4차산업혁명", "#개발", "#드론자격증", "cos자격증", "코딩능력마스터"
          "#코딩학원", "#코딩자격증", "coa자격증", "#컴퓨터자격증", "#C언어", 
          "#서빙로봇", "#프로그램", "#출력", "#정보", "#개발자", 
          "소프트웨어", "AI", "SW", "SW/AI", "엔트리ai",
          "메이커스",
          ]
comSkillUp = ["#ITQ자격증","#블록체인", "#VR", "#솔루션", "#자율주행", "#머신러닝", "#사물인터넷", 
          "#엑셀매크로", "#OCR", "#웹디자인", "#크롤링", "#공공데이터", "#언리얼엔진",     
]
parent = ["#대구아이와갈만한곳", "#어린이박물관", "#진로", "#의대", "#IB교육", 
          "#어린이", "#키즈", "#박람회", "#베스트셀러", "#영어", 
          "#수학학원", "#영어학원", "#창업", "#HME수학학력평가", "#오늘의회화", 
          "#수학", "#자기계발", "#진로", "#구구단", "#메타인지", 
          "#전자책", "#장난감", "#도서", "#심리상담", "#여름방학", 
          "#문방구", "#학원", "#2024수능", "#대구전시회추천", "#한국을빛낸100명의위인들", 
          "#원소주기율표", "#개정", "#미적분", "#문해력", "#대학원", 
          "#사회문제", "#중고서점", "#온라인클래스", "#수학여행", "#건강", 
          "#수학의정석", "#생명과학", "#SWOT분석", "#과학", "#수학자", 
          "#세계국기", "#역사", "#학사", "#분수", "#복사", 
          "#인문학", "#책베스트셀러", "#메탄올", "#화학", "#체험학습보고서", 
          "#과외", "#교육", "#기출문제사이트", "#취업박람회", "#임용고시", 
          "#방학", "#중고책", "#영어공부", "#영단어", "#영어도서관", 
          "#국어", "#썸머스쿨", "#세특", "#유치원문방구", "#확률과통계", 
          "#기숙학원", "#수학관련도서", "#사회", "#수능등급컷", "#인수분해", 
          "#기계공학과", "#코엑스박람회", "#전자도서관", "#벡터", "#물리", 
          "#독서", "#길이", "#사회문화", "#고등학교내신등급", "#베스트셀러소설", 
          "#수학능력시험", "#아르곤", "#내신등급", "#구구단표", "#체인", 
          "#촉매", "#배수", "#주니어", "#재즈", "#수능국어", 
          "#도덕", "#어린이전시회", "#어린이", "#문법", "#생기부", 
          "#문장", "#아동", "#어학원", "#2022수능", "#영화오디션", 
          "#자동문", "#지구과학", "#강의", "#학생부종합전형", "#입시컨설팅", 
          "#이러닝", "#성인영어학습지", "#재능", "#클래식음악", "#스터디", 
          "#어린이백과", "#생물", "#고전", "#평생사변형", "#교과서구입", 
          "#E러닝", "#인강", "#미래직업", "#가천대논술", "#중고서적", 
          "#영어캠프", "#교구", "#물질", "#방과후"
]
education = ["#고교학점제", "#디지털교과서", "#고교학점제수강신청", "#IB교육", "#진로", 
             "#교육과정", "#개정", "#개정교육과정", "#인공지능", "#디지털", 
             "#공동교육과정", "#입시", "#교과서", "#100만디지털인재양성"
]
haedalEss = ["#해달에듀", "#대구코딩학원", "#해달에듀코딩학원"]
haedalIf = ["#해달코딩", "#초등학생코딩","#대구코딩", "#대구초등학생코딩", "#대구코딩체험",
            "#대구코딩대회", "#대구레고에듀케이션", "#대구초등코딩수업","#대구초등코딩" 
            ]
etc = ["#용접기", "#환경오염", "#설날", "#무료웹툰", "#직장내괴롭힘", 
       "#안마기", "#메타인지", "#문방구", "#일본어학원", "#콘텐츠", 
       "#EBook", "#복지", "#사인", "#황", "#소방안전교육", 
       "#KF94마스크", "#애니어그램", "#일본워킹홀리데이", "#출결버스", "#PLAY스토어", 
       "#용접기능사", "#브레이크", "#목업", "#근무일수계산기", "#교통안전교육", 
       "#예고", "#일본워홀", "#방위", "#음악다운로드", "#차량용공기청정기", 
       "#근무시간계산기", "#관리", "#직업훈련", "#학원매매", "#교육대학원"
]

# 해시태그 분류 - 26개
# `comEdu` 코딩의무교육 키워드 - 10개
# `comSkillUp` 코딩평생교육 키워드 - 2개
# `parent` 학부모가 검색하는 인기키워드 - 5개
# `education` 교육정책 키워드 - 2개
# `haedalEss` 해달에듀 어필 필수 키워드 - 3개
# `haedalIf` 해달에듀 어필 선택 키워드 - 2개
# `etc` 기타 - 2개

result = random.sample(comEdu, 10) + random.sample(comSkillUp, 2) + random.sample(parent, 5) + random.sample(education, 2) + random.sample(etc, 2) + haedalESS + random.sample(haedalIf, 2)

# 결과 확인하기
print(result)
# 블로그 해시태그 입력
print(', '.join(result))